app/views/users/show.html.erb

    <td> Hashtags:
    <% tweet.hashtags.each do |hashtag| %>
---
SELECT "hashtags".* FROM "hashtags" WHERE "hashtags"."tweet_id" = ?  [["tweet_id", 2]]

  <tr>
    <td><%= link_to User.find(follower).name, user_path(User.find(follower)) %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]