app/views/hashtags/show.html.erb

  <% @hashtags.each do |hashtag| %>
    <%= Tweet.find(hashtag.tweet_id).text %><br>
---
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT 1  [["id", 2]]