app/views/welcome/index.html.erb

    <td> Hashtags:
    <% tweet.hashtags.each do |hashtag| %>
---
SELECT "hashtags".* FROM "hashtags" WHERE "hashtags"."tweet_id" = ?  [["tweet_id", 2]]