app/controllers/hashtags_controller.rb

  def show
    @hashtags = Hashtag.where(tag: params[:id])
---
SELECT "hashtags".* FROM "hashtags" WHERE "hashtags"."tag" = ?  [["tag", "#hi"]]