app/controllers/tweets_controller.rb

INSERT INTO "tweets" ("text", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["text", "#hi how's life"], ["user_id", 1], ["created_at", "2015-12-09 03:02:58.797284"], ["updated_at", "2015-12-09 03:02:58.797284"]]
SELECT "hashtags".* FROM "hashtags" WHERE "hashtags"."tweet_id" = ?  [["tweet_id", 1]]
---
  def create
    @tweet = Tweet.new(text: params[:tweet][:text], user: current_user)
    if @tweet.save
      make_tags
      @tweet.hashtags.each do |hashtag|

SELECT "hashtags".* FROM "hashtags" WHERE "hashtags"."tweet_id" = ?  [["tweet_id", 1]]
UPDATE "tweets" SET "text" = ?, "updated_at" = ? WHERE "tweets"."id" = ?  [["text", "#finals week #ugh Can't wait to #sleep"], ["updated_at", "2015-12-09 03:15:48.946206"], ["id", 1]]
---
  def update
    @tweet.hashtags.each(&:destroy)
    make_tags
    @tweet.update(text: params[:tweet][:text])

SELECT "hashtags".* FROM "hashtags" WHERE "hashtags"."tweet_id" = ?  [["tweet_id", 3]]
DELETE FROM "hashtags" WHERE "hashtags"."id" = ?  [["id", 8]]
DELETE FROM "tweets" WHERE "tweets"."id" = ?  [["id", 3]]
---
  def destroy
    @tweet.hashtags.each(&:destroy)
    @tweet.destroy