app/controllers/users_controller.rb

  def follow
    @follower = current_user
    @following = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]

  def create
    shorter_var
    @user = User.new(name: @n, password_hash: @p, email: @e, \
                     followers: [], following: [])
    @user.password = params[:user_password]
    if @user.save
---
INSERT INTO "users" ("name", "password_hash", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    @user.update(name: params[:user][:name])
---
UPDATE "users" SET "password_hash" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_hash", "$2a$10$AMikvIg1zRx.eeaX2ammD.RjKBdsaF7fAVVwwzak7bp/1otJu.OU2"], ["updated_at", "2015-12-09 03:09:17.238904"], ["id", 3]]

  def destroy
    remove_follower
    remove_following
    @user.tweets.each(&:destroy)
    @user.destroy
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = ?  [["user_id", 3]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]