app/controllers/welcome_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = ?  [["user_id", 1]]
---
  def index
    return unless logged_in?
    @all_tweets = []
    current_user.following.each do |follow|
      follow_user = User.find(follow)
      follow_user.tweets.each do |tweet|

SELECT  "users".* FROM "users" WHERE "users"."name" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["name", "Becca"]]
---
  def search
    user = User.where(name: params[:name]).first